Repository: yasielpv/pkp-purl-pubid
Catalog: locale/*/locale.po
Languages: es_es

# plugins.pubIds.purl.description
source: This plugin enables the assignment of the Persistent Uniform Resource Locator to the issues, articles and galleys in OJS.
es_es: Este módulo activa la asiganción de PURL (Localizador Persistente y Uniforme de Recursos) de los números, artículos y galeradas en OJS.

# plugins.pubIds.purl.manager.settings.description
source: Please configure the PURL plugin to be able to manage and use PURLs in OJS:
es_es: Configura el módulo PURL para poder administrar y usar PURLs en OJS:

# plugins.pubIds.purl.manager.settings.purlObjects
source: Journal Content
es_es: Contenido de la revista

# plugins.pubIds.purl.manager.settings.purlObjectsRequired
source: Please choose the objects PURLs should be assigned to.
es_es: Escoja los objetos a los que asignar PURLs.

# plugins.pubIds.purl.manager.settings.explainPURLs
source: Please select the publishing objects that will have Persistent Uniform Resource Locator (PURL) assigned:
es_es: Escoja los objetos publicados al los que asignar PURL (Localizador Persistente y Uniforme de Recursos):

# plugins.pubIds.purl.manager.settings.enableIssuePURL
source: Issues
es_es: Números

# plugins.pubIds.purl.manager.settings.enablePublicationPURL
source: Articles
es_es: Artículos

# plugins.pubIds.purl.manager.settings.enableRepresentationPURL
source: Galleys
es_es: Galeradas

# plugins.pubIds.purl.manager.settings.purlPrefix
source: PURL Prefix
es_es: Prefijo PURL

# plugins.pubIds.purl.manager.settings.purlPrefix.description
source: The PURL prefix is the fix, never changing part of the PURL.
es_es: El prefijo PURL es la parte no cambiante del PURL.

# plugins.pubIds.purl.manager.settings.purlSuffix
source: PURL Suffix
es_es: Sufijo PURL

# plugins.pubIds.purl.manager.settings.purlSuffix.description
source: A PURL suffix can take any form, but must be unique among all publishing objects with the same PURL prefix assigned:
es_es: El sufijo PURL pude tomar cualquier forma, pero debe ser único entre todos los objetos publicados bajo un mismo prefijo PURL:

# plugins.pubIds.purl.manager.settings.purlSuffixPattern
source: Use the pattern entered below to generate PURL suffixes. Use %j for journal initials, %v for the volume number, %i for the issue number, %s para el ID del n√∫mero, %Y for the year, %a for the OJS article ID, %g for the OJS galley ID, %f for the OJS file ID, %p for the page number and %x for "Custom Identifier".
es_es: Indique el patrón que desea emplear para generar sufijos PURL. Utilice %j para las iniciales de la revista, %v para el número de volúmen, %i para el número de número, %s para el ID del número, %Y para el año, %a para el ID de artículo, %g para el ID de galerada, %f para el ID de fichero, %p para el número de página y %x para el "Identificador personalizado"

# plugins.pubIds.purl.manager.settings.purlSuffixPattern.example
source: For example, vol%viss%ipp%p could create the PURL suffix "vol3iss2pp230".
es_es: Por ejemplo, vol%viss%ipp%p crearía el sufijo PURL "vol3iss2pp230".

# plugins.pubIds.purl.manager.settings.purlSuffixPattern.issues
source: for issues
es_es: para números

# plugins.pubIds.purl.manager.settings.purlSuffixPattern.submissions
source: for articles
es_es: para artículos

# plugins.pubIds.purl.manager.settings.purlSuffixPattern.representations
source: for galleys
es_es: para galeradas

# plugins.pubIds.purl.manager.settings.purlIssueSuffixPatternRequired
source: Please enter the PURL suffix pattern for issues.
es_es: Introduzca el patrón de sufijo PURL para los números.

# plugins.pubIds.purl.manager.settings.purlSubmissionSuffixPatternRequired
source: Please enter the PURL suffix pattern for articles.
es_es: Introduzca el patrón de sufijo PURL para los artículos.

# plugins.pubIds.purl.manager.settings.purlRepresentationSuffixPatternRequired
source: Please enter the PURL suffix pattern for galleys.
es_es: Introduzca el patrón de sufijo PURL para las galeradas.

# plugins.pubIds.purl.manager.settings.purlSuffixDefault
source: Use default patterns.
es_es: Usar los patrones por defecto.

# plugins.pubIds.purl.manager.settings.purlSuffixDefault.description
source: %j.v%vi%i for issues<br />%j.v%vi%i.%a for articles<br />%j.v%vi%i.%a.g%g for galleys.
es_es: %j.v%vi%i para números<br />%j.v%vi%i.%a para artículos<br />%j.v%vi%i.%a.g%g para galeradas.

# plugins.pubIds.purl.manager.settings.purlSuffixCustomIdentifier
source: Enter an individual PURL suffix for each published item. You'll find an additional PURL input field on each item's metadata page.
es_es: Introduzca un sufijo PURL individual para cada item publicado. Encontrará un campo adicional para el PURL en la pàgina de metadatos de cada item.

# plugins.pubIds.purl.manager.settings.purlResolver
source: Resolver URL
es_es: URL de resolución

# plugins.pubIds.purl.manager.settings.purlResolver.description
source: (e.g. https://n2t.net/)
es_es: (p.ej. http://purl.org/)

# plugins.pubIds.purl.manager.settings.form.purlResolverRequired
source: Please enter the resolver URL.
es_es: Introduzca la URL de resolución.

# plugins.pubIds.purl.manager.settings.purlReassign
source: Reassign PURLs
es_es: Reasignar PURLs

# plugins.pubIds.purl.manager.settings.purlReassign.description
source: If you change your PURL configuration, PURLs that have already been assigned will not be affected. Once the PURL configuration is saved, use this button to clear all existing PURLs so that the new settings will take effect with existing objects.
es_es: Si cambia su configuración PURL, los PURLs ya asignados no se verán afectadas. Cuando guarde la configuración PURL, podrá usar este botón para limpiar los PURLs existentes, de forma que la nueva configuración tenga efecto para todos los objetos exitentes.

# plugins.pubIds.purl.manager.settings.purlReassign.confirm
source: Are you sure you wish to delete all existing PURLs?
es_es: ¿Está seguro/a de que querer borrar todos los PURLs existentes?

# plugins.pubIds.purl.editor.purlObjectTypeIssue
source: issue
es_es: número

# plugins.pubIds.purl.editor.purlObjectTypeSubmission
source: article
es_es: artículo

# plugins.pubIds.purl.editor.purlObjectTypeRepresentation
source: galley
es_es: galerada

# plugins.pubIds.purl.editor.customSuffixMissing
source: The PURL cannot be assigned because the custom suffix is missing.
es_es: No se puede asignar un PURL porque falta el sufijo personalizado.

# plugins.pubIds.purl.editor.purl.description
source: The PURL must begin with {$prefix}.
es_es: El PURL debe empezar con {$prefix}.

# plugins.pubIds.purl.editor.patternNotResolved
source: The PURL cannot be assigned because it contains an unresolved pattern.
es_es: No se puede asignar un PURL porque contiene patrones sin resolver.

# plugins.pubIds.purl.editor.canBeAssigned
source: What you see is a preview of the PURL. Select the checkbox and save the form to assign the PURL.
es_es: Lo que se muestra es una vista previa del PURL. Seleccione la casilla de verificación y guarde el formulario para asignar el PURL.

# plugins.pubIds.purl.editor.assigned
source: The PURL is assigned to this {$pubObjectType}.
es_es: El PURL asignado a este {$pubObjectType}.

# plugins.pubIds.purl.editor.preview.objects
source: Item
es_es: Ítem

# plugins.pubIds.purl.editor.preview.galleys
source: Galley: {$galleyLabel}
es_es: Galerada: {$galleyLabel}

# plugins.pubIds.purl.editor.preview.publication.none
source: A PURL has not been assigned to this publication.
es_es: No se ha asignado ningún PURL a esta publicación.

# plugins.pubIds.purl.editor.preview.publication
source: The PURL for this publication will be {$purl}.
es_es: El PURL de esta publicación será {$purl}.

# plugins.pubIds.purl.editor.purlSuffixCustomIdentifierNotUnique
source: The given PURL suffix is already in use for another published item. Please enter a unique PURL suffix for each item.
es_es: El sufijo PURL dado ya está en uso para otro elemento publicado. Ingrese un sufijo PURL único para cada elemento.

# plugins.pubIds.purl.editor.clearObjectsPURL
source: Clear PURL
es_es: Limpiar PURL

# plugins.pubIds.purl.editor.clearObjectsPURL.confirm
source: Are you sure you wish to delete the existing PURL?
es_es: ¿Está seguro/a de querer borrar todos los PURL existentes?

# plugins.pubIds.purl.editor.clearIssueObjectsPURL
source: Clear Issue Objects PURLs
es_es: Limpiar PURLs de los Objetos del Número

# plugins.pubIds.purl.editor.clearIssueObjectsPURL.confirm
source: Are you sure you wish to delete the existing issue objects PURLs?
es_es: ¿Está seguro/a de querer borrar todos los PURLs de los objetos del número?

# plugins.pubIds.purl.editor.clearIssueObjectsPURL.description
source: Use the following option to clear PURLs of all objects (articles and galleys) currently scheduled for this issue.
es_es: Use la siguiente opción para limpiar los PURLs de todos los objetos (artículos y galerias) actualmente programados para este número.

# plugins.pubIds.purl.editor.missingParts
source: You can not generate a PURL because one or more parts of the PURL pattern are missing data. You may need to assign the publication to an issue, set a publisher ID or enter page numbers.
es_es: No puede generar un PURL porque una o más partes del patrón PURL no se encuentran. Sería necesario asignar la publicación a un número, establecer un identificador editorial o añadir los números de página.

# plugins.pubIds.purl.editor.missingIssue
source: You can not generate a PURL until this publication has been assigned to an issue.
es_es: No puede generar un PURL hasta que esta publicación haya sido asignada a un número.

# plugins.pubIds.purl.editor.assignPURL
source: Assign the PURL {$pubId} to this {$pubObjectType}
es_es: Asignar el PURL {$pubId} a este {$pubObjectType}

# plugins.pubIds.purl.editor.assignPURL.emptySuffix
source: The PURL cannot be assigned because the custom suffix is missing.
es_es: El PURL no se puede asignar porque falta el sufijo personalizado.

# plugins.pubIds.purl.editor.assignPURL.pattern
source: The PURL {$pubId} cannot be assigned because it contains an unresolved pattern.
es_es: El PURL {$pubId} no se puede asignar porque contiene patrones sin resolver.

# plugins.pubIds.purl.editor.assignPURL.assigned
source: The PURL {$pubId} has been assigned.
es_es: Se ha asignado el PURL {$pubId}.

# plugins.pubIds.purl.editor.purl.assignPurl
source: Assign
es_es: Asignar

# plugins.pubIds.purl.editor.purl.clearPurl
source: Clear
es_es: Limpiar
